Update README.md to be open source centric, adds resources
